In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\rohit\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\rohit\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\rohit\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\rohit\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\rohit\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\rohit\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import pandas as pd

In [10]:
data={"name":["Rohit","yashraj","vijay"],"age":[18,20,19],"gender":["male","male","male"]}

In [13]:
df=pd.DataFrame(data)

In [21]:
df1=pd.Series([18,19,20],name="Age")

In [23]:
df1

0    18
1    19
2    20
Name: Age, dtype: int64

In [22]:
type(df1)

pandas.core.series.Series

In [19]:
x=df["name"]

In [39]:
df["age"].mean()

19.0

In [32]:
y.max()

20

In [33]:
y.min()

18

In [35]:
y.Avg()

AttributeError: 'Series' object has no attribute 'Avg'

In [20]:
type(x)

pandas.core.series.Series

In [24]:
dataset={"Company":["Pw","Unacademy","Byjus"],"Job_required":["Maths Teacher","Physics teacher","Chemistry teacher"],"salary":[45,50,60]}

In [25]:
dataset

{'Company': ['Pw', 'Unacademy', 'Byjus'],
 'Job_required': ['Maths Teacher', 'Physics teacher', 'Chemistry teacher'],
 'salary': [45, 50, 60]}

In [27]:
dataframe=pd.DataFrame(dataset)

In [28]:
dataframe

     Company       Job_required  salary
0         Pw      Maths Teacher      45
1  Unacademy    Physics teacher      50
2      Byjus  Chemistry teacher      60

In [41]:
k=pd.Series([1,2,3,4],name="ROhit")

In [42]:
k

0    1
1    2
2    3
3    4
Name: ROhit, dtype: int64

In [54]:
k.max()

4

In [44]:
df

      name  age gender
0    Rohit   18   male
1  yashraj   20   male
2    vijay   19   male

In [45]:
df.describe()

        age
count   3.0
mean   19.0
std     1.0
min    18.0
25%    18.5
50%    19.0
75%    19.5
max    20.0

In [ ]:
country = ["Brazil", "Russia", "India", "China", "South Africa"]
capital = ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"]
area = [8.516, 17.10, 3.286, 9.67, 2.98]
population = [200.4, 143.5, 1252, 133, 4.3]

In [48]:
df1={"country" : ["Brazil", "Russia", "India", "China", "South Africa"],
"capital" : ["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area" : [8.516, 17.10, 3.286, 9.67, 2.98],
"population" : [200.4, 143.5, 1252, 133, 4.3],
    
}

In [49]:
df1

{'country': ['Brazil', 'Russia', 'India', 'China', 'South Africa'],
 'capital': ['Brasilia', 'Moscow', 'New Delhi', 'Beijing', 'Pretoria'],
 'area': [8.516, 17.1, 3.286, 9.67, 2.98],
 'population': [200.4, 143.5, 1252, 133, 4.3]}

In [51]:
x=pd.DataFrame(df1)

In [52]:
x

        country    capital    area  population
0        Brazil   Brasilia   8.516       200.4
1        Russia     Moscow  17.100       143.5
2         India  New Delhi   3.286      1252.0
3         China    Beijing   9.670       133.0
4  South Africa   Pretoria   2.980         4.3

In [53]:
x.describe()

            area   population
count   5.000000     5.000000
mean    8.310400   346.640000
std     5.762066   511.167158
min     2.980000     4.300000
25%     3.286000   133.000000
50%     8.516000   143.500000
75%     9.670000   200.400000
max    17.100000  1252.000000

In [65]:
r=pd.Series([8.516, 17.1, 3.286, 9.67, 2.98],name="Yash")

In [66]:
r.max()

17.1

In [67]:
r.min()

2.98

In [68]:
r.mean()

8.3104

In [69]:
r.describe()

count     5.000000
mean      8.310400
std       5.762066
min       2.980000
25%       3.286000
50%       8.516000
75%       9.670000
max      17.100000
Name: Yash, dtype: float64

In [70]:
x.shape

(5, 4)

In [81]:
x.index=range(2,12,2)

In [82]:
x

         country    capital    area  population
2         Brazil   Brasilia   8.516       200.4
4         Russia     Moscow  17.100       143.5
6          India  New Delhi   3.286      1252.0
8          China    Beijing   9.670       133.0
10  South Africa   Pretoria   2.980         4.3

In [83]:
x.index=["A",]

RangeIndex(start=2, stop=12, step=2)